// ReSharper disable CommentTypo
//Console.WriteLine("uncomment code");

/*  №1
Дан файл numsTask1.txt со словами. Выведите все слова нечетной длины;
*/



//-----------------------------------------------------------------------------

/*  №2
Дан файл numsTask2.txt со словами расположенными в столбик. Из заданных
слов составьте одну длинную строку(разделить каждое слово пробелом);
*/

//-----------------------------------------------------------------------------

/*  №3
Дано число. Определите будет ли это число четным и кратным 10;
*/

//-----------------------------------------------------------------------------

/*  №4
Вводятся положительные числа. Определите сумму чисел, делящихся на
положительное число a нацело. При вводе отрицательного числа закончите работу;
*/

//-----------------------------------------------------------------------------

/*  №5
Дана прямоугольная матрица a, имеющей n строк и m столбцов. Исходная
матрица состоит из нулей и единиц. Добавьте к матрице еще один столбец, каждый
элемент которого делает количество единиц в каждой строке четным;
*/

//-----------------------------------------------------------------------------

/*  №6
Дан массив со случайным количеством дробных чисел. Из элементов
исходного массива постройте два новых. В первый должны входить только
положительные элементы, а во второй только отрицательные элементы;
*/